Revit 2027 API
LinePattern(String) Constructor
 Creates a line pattern with given name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LinePattern(
	string name
)
Public Sub New (
	name As String
)
public:
LinePattern(
	String^ name
)
new :
        name : string -> LinePattern
Parameters
name String
 The name.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
LinePattern Class
LinePattern Overload
Autodesk.Revit.DB Namespace